{
  "url": "https://docs.lytics.com/docs/usage-metrics",
  "title": "Usage Metrics",
  "content": "Usage Metrics\nSuggest Edits\nAccount Usage Metrics\nThe Account Usage section shows how many inbound and outbound events Lytics has received for your account. If your account has an inbound event quota, you will find a meter displaying how much of your inbound event quota you have used for each quota period.\nIn the Lytics UI, select\nVault\nfrom the product switcher. Or, if you are already in Vault, select\nUsage\nfrom the main menu.\nThis view offers a quick way to gauge the quantity of data Lytics has received from your various Sources. Of course, if you would like to explore details for incoming data further you can view more granular details of all connected Sources from the\nConductor\ninterface.\nInbound Events\nAn\ninbound event\nis a record of activity collected or uploaded to Lytics from a customer data source, such as a record of user web activity, email opening, or an update to a subscriber record. The inbound events graph shows your total inbound events, which can be displayed daily, weekly, or monthly.\nThe inbound quota meter displays the number of events recorded in the quota period, your quota limit, and the meter to gauge your usage versus your quota limit quickly. For monthly term accounts, quota periods begin on the first of each month and end on the last day of the month. For annual term accounts, quota periods begin at the start of your Lytics subscription. Quotas (unless otherwise stated in your contract) only count for production accounts.\nMonitoring the Inbound Event Quota\nAutomated alerts for Inbound Event Quotas can be configured to sent to\nMicrosoft Teams\n,\nSlack\n, or directly to an\nemail address\n.\nOutbound Events\nAn\noutbound event\nis any record of data exported from Lytics, whether manually or automatically. The outbound events graph shows your total outbound events, which can be displayed daily, weekly, or monthly.\nUpdated\n12 months ago",
  "source": "lytics"
}