{
  "url": "https://docs.lytics.com/docs/lytics-communication",
  "title": "Lytics Communication",
  "content": "Lytics Communication\nSuggest Edits\nThere are many reasons why Lytics and partners need to communicate across different tools, here are some best practices on how to get the most out of your communication with Lytics staff. Please note, that this is not an exhaustive list of scenarios, the following should be considered a guideline.\nCommunity\n- Lytics has a community section on their docs site where users of Lytics can ask general questions about Lytics, how to use Lytics, and what’s possible with Lytics. Think of this community area as your Lytics Stackoverflow. The Lytics Community can be found here.\nSome examples of community-type questions are:\n“Regarding the NLP engine, are you able to scrape all the contents of, apply topics to, and associate topic scores to users on PDFs?”\n“Can one set up alerts for jobs failing and/or being deleted like you can set up alerts for event overages?”\n“Is there an endpoint I can hit to see hidden streams?”\nCustomer-specific questions or questions that regard Solution Architecture (complex) for a customer are not suitable for the Community section and should be asked in Zendesk.\nZendesk\n- All customers and partners working on behalf of customers can use the Lytics Support Portal for the following:\nReport technical issues with the Lytics platform, e.g. Bug reports\nFeature Requests\nSolution architecture questions that require discretion with customer needs\nAssistance with features that may not be accessible by a partner or customer\nPartners can contact the Lytics support team through support.lytics.com or\n[email protected]\n, which will create a Zendesk ticket.\nSlack & Email\n- Partners are encouraged to communicate directly with the Lytics team for other partnership needs. Please prioritize Community and Zendesk for any customer CDP-related questions.\nSome examples of Email and Slack communications are:\nContract questions, billing invoices, or other administrative needs\nPartnership questions\nLytics Training\nCustomer status check-ins\nMeeting coordination\nCustomer-specific issues that are not appropriate in the Lytics public Community forum\nUpdated\n4 months ago",
  "source": "lytics"
}