{
  "url": "https://docs.lytics.com/docs/managing-cloud-connections",
  "title": "Connecting Warehouses",
  "content": "Connecting Warehouses\nSuggest Edits\nAccess\nCloud Connect tabs are found under\nData Pipeline\n>\nCloud Connect\n. Connections configure the access to your data warehouses, and Data Models configure the SQL queries that are run to connect audience membership and profile attributes.\nCreating a Connection\nClick\n+ Create New Connection\nfrom the Connections Dashboard at the top right and complete the following steps.\nChoose the provider.\nChoose the Connection type.\nSelect an existing Authorization or create a new one by following the\nAuthorization instructions\n.\nAdd a name (label), description, and complete the configuration options. These will vary slightly between providers.\nAuthorization & Security\nThe authorization selected for your Connection will control your Lytics account users' access to your data warehouse. You can control whether a user has read access to the entire dataset or individual tables, maintaining your security and governance practices within your data warehouse.\nSupported Data Warehouses\nCloud Connect currently supports a number of popular data warehouses:\nAmazon Redshift\nDatabricks\nGoogle BigQuery\nMicrosoft Azure SQL Database\nSnowflake\nManaging Connections\nOnce you have created a Connection, you can access a summary page showing how data from your data warehouse is being leveraged in Lytics. At the top of the page, you’ll see the following information:\nProvider\n: Data warehouse that you are connecting with Lytics.\nAuthorization\n: Name of the authorization, such as “Cloud Connect JWT.” Note: Lytics users can access any data tables that the Connection Authorization has read access to.\nType\n: Indicates the type based on your provider.\nCreated By\n: Lytics user who created the Connection.\nCreated On\n: Date the Connection was initially created.\nLast Updated\n: Date the Connection was most recently edited.\nThe rest of the Summary tab shows how many active and inactive data models are built using this Connection as a data source and how many tables are accessible from this dataset. The Activity chart displays how many rows are being queried, which can have cost implications based on your data warehouse usage.\nExplore\nThe Explore tab provides a simple Schema Explorer to validate that the data shown is as you would expect to see in your data warehouse. In the example below, we only connected an individual table, but here you will see as many tables as the authorization has read access to.\nDetails\nThe Details section displays all the information about setting up your Connection, including the authorization and configuration settings.\nLogs\nThe Logs section records the history of events for this Connection, which are helpful to ensure your connection is working as expected. Below are the connection event types you may see.\nConnection Events\nDescription\nCreated\nFirst event indicating the Connection is active.\nUpdated\nConnection was updated by a Lytics user.\nDeleted\nConnection was removed and any data models built on this Connection will no longer be updated.\nUpdated\n4 months ago",
  "source": "lytics"
}