{
  "url": "https://docs.lytics.com/docs/developer-quickstart-3-install-lytics",
  "title": "1. Install the Lytics Tag",
  "content": "1. Install the Lytics Tag\nSuggest Edits\nInstalling the Tag\nIn the Web SDK, Lytics provides a tag that can be placed on your site to collect behavioral data and surface the materialized profile back to your browser in real time. Manual installation instructions are available from within the app at\nData Pipeline\n>\nSDK\n>\nWeb SDK\n.\nIf your site is a\nDrupal\nor\nWordpress\nsite, or you use\nGoogle Tag Manager\nwe recommend using one of these turnkey methods to install the Lytics Tag:\nDrupal\nFor Drupal users, getting up and running is as simple as installing the official\nLytics Drupal module\n. Once you have the module added to your site using\ncomposer\nor another preferred method, you will want to complete the following configuration steps:\nVisit the\nConfiguration\npage either from the module details in the\nExtend\nsection of Drupal or directly from the\nConfiguration\nsection (\n/en/admin/config/system/lytics\n).\nAdd a valid API Token for your Lytics account. Be sure to give that token\nadmin\nprivileges, as that will unlock account verification and direct access to all Lytics systems responsible for surfacing and managing profiles and personalization. This token should also have no expiration, as it will need continued access to your Lytics account. For more information visit our\nAccess Token documentation\n.\nWith your token entered. Ensure the\nEnable Tab\nsetting is selected. This will automatically place the Lytics JavaScript SDK onto all public pages of your site.\nUpon\nsaving configuration\n, your account details will be surfaced. Be sure to verify that your token is for the Lytics account you are currently configuring.\nThat's it!\nWordPress\nA formal WordPress plugin is currently under development and coming soon.\nGoogle Tag Manager\nFrom the left-hand navigation to select\nData Pipeline\n>\nSDK\n>\nWeb SDK\n.\nSetup and install\nGoogle Tag Manager.\nCreate a new\nCustom HTML\ntag and place the Lytics JavaScript snippet into the text box.\nEnsure the tag is triggered on the pages you desire. We recommend using the\nAll Pages\ndefault trigger to start.\nSubmit and\npublish\nyour Google Tag Manager version.\nTesting the Lytics Tag Installation\nOnce the tag has been installed, validate a successful installation via one of the three following methods:\nLytics Dev Tools Chrome Extension\n(Recommended)\nThe Lytics Dev Tools Chrome Extension makes validation and exploration simple. Once you've installed the extension as outlined above:\nOpen the extension and ensure it has been activated.\nThe interface will display a message to confirm the correct installation of the Lytics tag and relevant configuration details.\nIn-app Verification Assistant\nWe've built a simple tool to validate that data flows into your Lytics account. Please note that the collected events may take a few minutes to reflect in the UI.\nSelect\nVault\nusing the product switcher at the top left.\nUse the left-hand navigation to select\nSetup\n>\nJavaScript Tag\nAt the bottom of the page\nSetup click the\nrefresh\nbutton to validate installation if it does not already state\nSuccessfully installed\n.\nManually\nIf you prefer to verify the installation manually, you can do so by opening the Chrome developer console and ensuring\njstag\nis accessible. In addition, by viewing the network tab, you can monitor data collection requests being sent to\nlytics.io/c\nand personalization requests being loaded from\nlytics.io/api/personalize\nTesting the Current Visitor's Profile via JavaScript SDK\nThe final step to verify installation is ensuring you can access your visitor profile. This profile is built and delivered in real-time as you engage with content.\nLytics Dev Tools Chrome Extension\n(Recommended)\nThe Lytics Dev Tools Chrome Extension makes validation and exploration simple. Once you've installed the extension as outlined above:\nOpen the extension and ensure it has been activated.\nAccess\nProfile\nfrom the bottom menu in the Chrome extension.\nThis section of the extension profiles two views into your profile.\nThe first is the\nSummary\nshowcasing available attributes and affinities.\nThe second is the\nDetails\n, which profiles a raw JSON dump of all available attributes and insights accessible via the Personalization Engine web SDK.\nManually\nIf you prefer to verify the installation manually, you can do so by opening the Chrome developer console and ensuring\njstag\nis accessible. In addition, by viewing the network tab, you can monitor data collection requests being sent to\nlytics.io/c\nand personalization requests being loaded from\nlytics.io/api/personalize\nUpdated\n5 months ago\nWhat’s Next\n2. Content Setup",
  "source": "lytics"
}