{
  "url": "https://docs.lytics.com/docs/javascript-tag-config",
  "title": "JavaScript Tag Config",
  "content": "JavaScript Tag Config\nConfiguration options for the core JavaScript SDK.\nSuggest Edits\nThe following configuration options are available within the account settings\nJavaScript Tag\nsection.\nClient Side Integrations\nA set of client-side integrations is facilitated by the core Lytics SDK. Each of those integrations is either deployed or disabled based on a series of checkboxes under the \"Client Side Integrations\" section. Each of those options follows the pattern outlined below.\nChecking the box enables the integration and will result in either audience membership or attributes being passed to a partner if that particular integration's associated tags and configurations are also in place on the page.\nClient-side integrations supported out of the box:\nAmazon DSP:\nAllow Lytics to pass the current visitor's\n_uid\nto Amazon DSP for improved identity resolution.\nAmazon DSP Confirmation Events:\nIf false, confirmation events will not be sent to the amazon_dsp stream upon successful sync completion.\nCriteo:\nAllow Lytics to pass the current visitor's\n_uid\nto Criteo and receive a Criteo GUM ID for improved identity resolution.\nGoogle Ads Partner API:\nAllow Lytics to use the Google Partner API to make Google Ads calls.\nGoogle Analytics 4 (GA4):\nAllow Lytics to pass the current visitor's\n_uid\nand audience membership to GA4.\nGoogle DV360:\nAllow Lytics to pass the current visitor's\n_uid\nto Google DV360 and receive a unique DV360 ID for improved identity resolution.\nKrux:\nAllow Lytics to pass the current visitor's _uid to Krux for improved identity resolution.\nLotame:\nAllow Lytics to pass the current visitor's _uid to Lotame for improved identity resolution.\nTaboola:\nAllow Lytics to pass the current visitor's _uid to Taboola and receive a unique Taboola ID for improved identity resolution.\nThe Trade Desk:\nAllow Lytics to pass the current visitor's _uid to The Trade Desk and receive a unique Trade Desk ID for improved identity resolution.\nYahoo Ads:\nAllow Lytics to pass the current visitor's _uid to Yahoo and receive a unique Yahoo ID for improved identity resolution.\nIn addition to those outlined above, many automatic client-side integrations are included within the Lytics core SDK. These integrations automatically sync enabled profile data with other tools if those tools have been configured on your site, too. For instance, Lytics will sync audience membership for the current visitor with Meta if the Meta pixel is also present on the page. To prevent these syncs, each integration can be blocked by adding the proper key to the \"Integrations Blocklist\" as outlined below:\nIn this example, we have added the \"google_analytics_dimensions\" slug to the blocklist to prevent sending profile data to custom dimensions in Google Universal Analytics.\nAvailable client-side integrations and their associated slugs:\nName\nSlug\nDescription\nAdroll\nadroll\nAdds a record named\nadroll_segments\nto the user, which houses audience membership.\nAddThis\nadd_this\nAdds the current audience membership to the\n__attag\ncookie.\nAmazon DSP\namazon\nAdds the Amazon DSP pixel to the site.\nFacebook Ads\nfacebook_ads\nPushes Lytics audience membership as an array to the custom\nLytics Audiences\nvalue for the user.\nGoogle Analytics\ngoogle_analytics_dimensions\nPushes audience membership as a comma-separated string to a predefined custom dimension. It also emits a\nnoninteraction\nevent each time the sync occurs for a user.\nGoogle DFP\ngoogle_dfp\nSets audience membership to a targeting param with the name\nLyticsSegments\n.\nGoogle Tag Manager\ngtm\nCollects the\ndataLayer\nobject when the Lytics tag loads. It also passes audience membership to GTM as a push event.\nKrux\nkrux\nAdds the Krux pixel to the site.\nLotame\nlotame\nAdds the Lotame pixel to the site.\nOptimizely\noptimizely\nPushes a custom tag with the audience membership.\nPathfora\npathfora\nAllows for the installation of Pathfora (Lytics  Personalization SDK).\nQubit\nqubit\nCollects the\nuniversal_variable\nobject when the Lytics tag loads.\nLytics Audience Cookie\nsegments_cookie\nStores current audience membership for the user as a cookie.\nTaboola\ntaboola\nAdds the Taboola pixel to the site.\nTealium\ntealium\nCollects the\nutag_data\nobject when the Lytics tag loads.\nJavaScript Tag TTL (3.0)\nThe amount of time to cache the core JavaScript SDK in seconds. This should be used only during testing to ensure settings configured are reflected more often, but it may result in degraded performance for high-traffic production use.\nEnable pageview event on first send (3.0)\nEnables the automatic pageview event (_e: pv) in the first send event of every page load in JStag v3.\nAllow Pathfora\nCheck this box to allow the Lytics JavaScript tag to automatically add the Pathfora personalization library to your site (default). Uncheck to disable any Pathfora-powered web-based personalization.\nAllow Event Block\nCheck this box to allow the Lytics JavaScript tag to automatically add the Pathfora personalization library to your site (default). Uncheck to disable any Pathfora-powered web-based personalization.\n0\n: Turns event block off.\n1\n: Turns event block on if there are one or more active Lytics Experiences.\n2\n: Turns event block on permanently at all times.\nGlobal Stylesheet URL (CSS)\nThis custom stylesheet will be loaded in support of Lytics-managed Experiences.\nURL Allowlist for Orchestration (Experiences)\nList of strings that, if matched, will result in Experiences being evaluated in place of legacy campaign variations.\nPersonalization (Pathfora SDK) Generalized Config\nThe hashed JSON configuration is to be loaded globally for all Lytics-managed experiences.\nCustom Cookie Keys\nA list of cookie names that should be automatically collected by the core Lytics SDK.\nCustom Data Layer\nA list of JavaScript variables that should be automatically collected by the core Lytics SDK.\nDisable Automatic Initial Pageview (2.0 - Deprecated)\nDisable the automatic pageview event in the JStag v2 if pageview events are being sent manually.\nJstag2 Segment Cookie Duration (2.0 - Deprecated)\nThe number of minutes the ly_segs cookie that contains an individual's current audience memberships should persist. Defaults to 30 days if left blank.\nUpdated\nabout 1 year ago",
  "source": "lytics"
}