{
  "url": "https://docs.lytics.com/docs/developer-attributes",
  "title": "Default Attributes",
  "content": "Default Attributes\nSuggest Edits\nLytics offers a wide range of pre-packaged user attributes, including automatically generated and customizable ones. Additionally, Lytics employs predictive modeling and machine learning algorithms to provide insights and scores, allowing users to gain a deeper understanding of their audience. The guide below provides an overview of all available attributes and examples to enhance your profiling efforts.\nðŸ‘\nIf you haven't already reviewed our\ndocumentation on collecting events\nvia our JavaScript SDK, we highly recommend doing so first. This will give you a better understanding of how data collection works at a high level before delving into the specifics of what can be collected.\nAvailable Attributes\nThe following attributes are all available out of the box with no customization necessary in all Lytics pricing tiers. Do note that any attributes flagged as\nComputed\ncan not be edited directly but are computed based on various factors, including other non-computed attributes.\nðŸ“˜\nFor a more comprehensive example of how any of the following attributes can be collected and used for your visitors click the\nname\nof the identifier to access the code examples below.\nIdentifiers\nDefault attributes that are used to stitch profiles together. For instance, if you pass an\nemail\nalong with the\n_uid\n, all events that have only been associated with either identifier will be merged into a single comprehensive profile.\nName\nSlug\nDescription\nComputed\nExample\nLytics ID\n_id\nA unique ID that represents the materialized profile in Lytics.\nYes\n4fafb5b3-b199-58f2-a68b-4b266b363dd1\nCurrent Lytics Cookie\n_uid\nThe current cookie id for the user.\nNo\n50b772f5-a0be-42f2-8828-84b8db5d5a23\nAll Lytics Cookies\n_uids\nAll cookies that are associated with the user.\nNo\n[\"50b772f5-a0be-42f2-8828-84b8db5d5a23\"]\nEmail\nemail\nThe email address of the user.\nNo\n[emailÂ protected]\nUnique User ID\nuuid\nA UUID for the user.\nNo\n4fafb5b3-b199-58f2-a68b-4b266b363dd1\nDetails\nDetails encompass all default attributes related to user demographics and general information, including name, phone number, status, etc. It serves as a catch-all for attributes not specifically tied to interactions or behaviors.\nName\nSlug\nDescription\nComputed\nExample\nName\nname\nThe full name of the user.\nNo\nJohn Doe\nFirst Name\nfirst_name\nThe first name of the user.\nNo\nJohn\nLast Name\nlast_name\nThe last name of the user.\nNo\nDoe\nTitle\ntitle\nThe title of the user.\nNo\nPresident\nPhone\nphone\nThe phone number of the user.\nNo\n555-555-5555\nCell\ncell\nThe cell phone number of the user.\nNo\n555-555-5555\nOrigin\norigin\nThe origin of the user.\nNo\nloyalty_2022\nLanguage\nlanguage\nThe language of the user.\nNo\nen-us\nAge\nage\nThe age of the user.\nNo\n25\nCompanies\ncompanies\nThe companies the user is associated with.\nNo\n[\"Lytics\", \"Pantheon\"]\nGender\ngender\nThe gender of the user.\nNo\nM\nStatus\nstatus\nThe status of the user.\nNo\nactive\nUser Attributes\nuser_attributes\nA map of custom attributes associated with the user.\nNo\n{\"role\": \"member\", \"bonus\": \"active\"}\nTimezone\ntimezone\nThe timezone of the user.\nNo\n-7\nCity\ncity\nThe city of the user.\nNo\nDenver\nCountry\ncountry\nThe country of the user.\nNo\nUS\nState\nstate\nThe state of the user.\nNo\nCO\nMeta\nMeta encompasses all system-level information that provides insights into the health and breadth of the profile. This includes data such as creation date, last update timestamp, source information, and other metadata associated with the profile's management and maintenance. Metadata offers a behind-the-scenes view of the profile's overall status and administration.\nName\nSlug\nDescription\nComputed\nExample\nCreated\n_created\nThe date the user was created.\nYes\n2023-12-12T21:09:11.625960142Z\nLast Scored\n_last_scored\nThe date the user was last scored.\nYes\n2024-02-28T02:45:51.377423153Z\nModified\n_modified\nThe date the user was last modified.\nYes\n2024-02-28T02:45:51.377423473Z\nNumber of Aliases\n_num_aliases\nThe number of aliases for the user.\nYes\n1\nNumber of Days\n_num_days\nThe number of days the profile has existed.\nYes\n38\nNumber of Events\n_num_events\nThe number of events the user has been associated with.\nYes\n2425\nNumber of Streams\n_num_streams\nThe number of streams the user has been associated with.\nYes\n2\nStream Names\n_streamnames\nThe names of the streams the user has been associated with.\nYes\n[\"default\", \"ios\"]\nUser is Bot\nis_bot\nWhether the user has been flagged as a bot or not.\nYes\nf\nBehavior\nBehavioral attributes typically cannot be directly managed but represent a set of insights derived from a user's behavior over time. These insights are invaluable when personalizing experiences based on changes in behavior or behaviors indicative of high likelihood. For instance, you might want to present a premium offer to users exhibiting higher momentum than usual. Behavioral attributes enable targeted and timely interventions tailored to user actions and patterns.\nName\nSlug\nDescription\nComputed\nExample\nConsistency\nscore_consistency\nScore representing how consistent their activity patterns are.\nYes\n99\nFrequency\nscore_frequency\nA score representing how frequently the user is active.\nYes\n63\nIntensity\nscore_intensity\nA score representing how intense the user's activity is.\nYes\n94\nMaturity\nscore_maturity\nA score representing how mature the user's activity is.\nYes\n34\nMomentum\nscore_momentum\nA score representing how much momentum the user currently has.\nYes\n54\nPropensity\nscore_propensity\nA score representing how likely the user is to engage again.\nYes\n1\nQuantity\nscore_quantity\nA score representing how much activity the user has.\nYes\n99\nRecency\nscore_recency\nA score representing how recent the user's activity is.\nYes\n99\nVolatility\nscore_volatility\nA score representing the degree of variability in behavior.\nYes\n99\nInterests\nInterests entail understanding the topics a user is interested in based on their interactions, cross-referenced by deep programmatic analysis of their online activities. This allows for tailored content recommendations and targeted messaging aligned with the user's preferences and engagement history.\nName\nSlug\nDescription\nComputed\nExample\nLytics Content\nlytics_content\nA map of topic-level interests for the user.\nYes\n{\"Baking\": 0.26418695138978837}\nIntelligence\nAttributes classified as intelligence encompass diverse, highly valuable information to facilitate relevant and high-value personalized experiences. Within this category, you'll discover real-time segment membership, values crucial for split testing and experimentation, and direct correlation to our real-time machine learning modeling. These attributes empower dynamic and data-driven decision-making, enhancing the efficacy of personalized marketing strategies.\nName\nSlug\nDescription\nComputed\nExample\nSegment Membership\n_segments\nThe segments the user is associated with.\nYes\n[\"all\", \"anonymous_profiles\", \"smt_power\"]\nSplit\n_split\nA random value that is evenly distributed across users.\nYes\n74\nSplit 2\n_split2\nA random secondary value that is evenly distributed across users.\nYes\n58\nNeeds Message\nneeds_message\nStream-specific score that represents the relative distance between now and the next predicted event.\nYes\n{\"default\": 0.05758899316182292}\nNext Event\nnext_event\nStream-specific prediction for the next expected event.\nYes\n{\"default\": \"2024-03-01T03:00:00Z\"}\nLookalike Model Predictions\nsegment_prediction\nScores from Lytics Lookalike and SegmentML models.\nYes\n{\"likely_to_churn\": 0.26418695138978837}\nLookalike Model Percentiles\nsegment_prediction_percentile\nPercentiles from Lytics Lookalike and SegmentML models.\nYes\n{\"likely_to_churn\": 0.26418695138978837}\nActivity\nActivity encompasses the user's engagement across different channels and campaigns, including clicks and conversions. It provides valuable insights into recent interactions, aiding campaign optimization and channel effectiveness assessment.\nGeneral\nName\nSlug\nDescription\nComputed\nExample\nFirst Seen\nevent_first_seen\nThe first time the user was seen for a specific event.\nNo\n{\"click\": \"2023-12-12T21:09:11.625Z\"}\nLast Seen\nevent_last_seen\nThe last time the user was seen for a specific event.\nNo\n{\"click\": \"2024-02-28T02:45:49.776Z\"}\nChannels\nchannels\nThe channels the user has been active on.\nNo\n[\"web\", \"email\"]\nDevices\ndevices\nThe devices the user has been active on.\nNo\n{\"desktop\": 123}\nHourly\nhourly\nThe number of events per hour for the user.\nYes\n{\"0\": 17, \"1\": 69, \"2\": 262, \"3\": 97}\nHour of Week\nhourofweek\nThe number of events per hour of the week for the user.\nYes\n{\"3\": 2, \"4\": 2, \"5\": 1, \"11\": 3}\nLast Active\nlast_active_ts\nThe last time the user was active.\nNo\n2024-02-28T02:45:50.784Z\nLast Channel Activities\nlast_channel_activities\nThe last time the user was active on a specific channel.\nNo\n{\"web\": \"2024-02-28T02:45:50.784Z\"}\nWeb\nName\nSlug\nDescription\nComputed\nExample\nDomains\ndomains\nThe domains the user has been active on.\nNo\n[\"umami.lytics.com\"]\nFirst Visit Timestamp\nfirstvisit_ts\nThe first time the user visited the site.\nNo\n2023-12-12T21:09:11.625Z\nLast Visit Timestamp\nlastvisit_ts\nThe last time the user visited the site.\nNo\n2024-02-28T02:45:50.784Z\nPageview Count\npageviewct\nThe number of pageviews the user has had.\nYes\n234\nReferring Domain\nrefdomain\nThe referring domain for the user.\nNo\n[\"umami.lytics.com\"]\nUser Agent\nuser_agent\nThe user agent for the user.\nYes\nChrome\nVisit Count\nvisitct\nThe number of visits the user has had.\nYes\n145\nVisit City\nvisit_city\nThe city the user visited from.\nYes\nDenver\nVisit Country\nvisit_country\nThe country the user visited from.\nYes\nUS\nVisit Region\nvisit_region\nThe region the user visited from.\nYes\nCO\nForm Data\nform_data\nThe form data the user has submitted.\nNo\n{\"first_name\": \"John\"}\nForms Submitted\nforms_submitted\nThe forms the user has submitted.\nNo\n[\"newsletter\", \"contact\"]\nUTM Campaign Last\nutm_campaign_last\nThe last UTM campaign referred from.\nNo\nholiday\nUTM Campaigns\nutm_campaigns\nThe UTM campaigns the user has interacted with.\nNo\n[\"holiday\", \"summer\"]\nUTM Content Last\nutm_content_last\nThe last UTM content referred from.\nNo\nrecipe-1\nUTM Contents\nutm_contents\nThe UTM contents the user has interacted with.\nNo\n[\"recipe-1\", \"recipe-2\"]\nUTM Medium Last\nutm_medium_last\nThe last UTM medium referred from.\nNo\narticle\nUTM Mediums\nutm_mediums\nThe UTM mediums the user has interacted with.\nNo\n[\"article\", \"recipe\"]\nUTM Source Last\nutm_source_last\nThe last UTM source referred from.\nNo\ngoogle_ads\nUTM Sources\nutm_sources\nThe UTM sources the user has interacted with.\nNo\n[\"google_ads\", \"meta_ads\"]\nUTM Term Last\nutm_term_last\nThe last UTM term referred from.\nNo\nexample\nUTM Terms\nutm_terms\nThe UTM terms the user has interacted with.\nNo\n[\"example\"]\nCampaign\nName\nSlug\nDescription\nComputed\nExample\nHover\nly_hover\nThe number of times the user hovered over a specific campaign.\nNo\n{\"content-rec-modal\": 5}\nImpressions\nly_impressions\nThe number of times the user saw a specific campaign.\nNo\n{\"content-rec-modal\": 1}\nCloses\nly_closes\nThe number of times the user closed a specific campaign.\nNo\n{\"content-rec-modal\": 10}\nConversions\nly_conversions\nThe number of times the user converted on a specific campaign.\nNo\n{\"content-rec-modal\": 2}\nMilestones\nly_milestones\nThe number of times the user reached a milestone on a campaign.\nNo\n{\"engaged-donation-page\": 1}\nGoals\nly_goals\nThe number of times the user reached a goal on a campaign.\nNo\n{\"made-donation\": 1}\nExamples\nIdentifiers\nLytics ID (\n_id\n)\nThis is an automatically generated canonical ID managed by Lytics. It refers to the materialized profile and cannot be customized or overridden.\nCurrent Lytics Cookie (\n_uid\n) and All Lytics Cookies (\n_uids\n)\n_uid represents the Lytics anonymous 1st party cookie. This value is automatically captured with every\njstag.send()\ncall from the JavaScript tag. The only way to customize this value is to explicitly set the value of _uid, which we do not recommend.\nJavaScript\njstag.setid(\"somecustomvalue\");\njstag.send();\nEmail (\nemail\n)\nJavaScript\njstag.send({\n  email:\"\n[emailÂ protected]\n\"\n});\nUnique User ID (\nuuid\n)\nJavaScript\njstag.send({\n  uuid:\"someuniqueuserid\"\n});\nDetails\nFirst Name (\nfirst_name\n)\nJavaScript\njstag.send({\n  first_name:\"John\",\n});\nLast Name (\nlast_name\n)\nJavaScript\njstag.send({\n  last_name:\"Doe\",\n});\nTitle (\ntitle\n)\nJavaScript\njstag.send({\n  title:\"President\",\n});\nPhone (\nphone\n)\nJavaScript\njstag.send({\n  phone:\"555-555-5555\",\n});\nCell (\ncell\n)\nJavaScript\njstag.send({\n  cell:\"555-555-5555\",\n});\nOrigin (\norigin\n)\nJavaScript\njstag.send({\n  origin:\"loyalty_2022\",\n});\nLanguage (\nlanguage\n)\nBy default, the Lytics JavaScript SDK will collect language information based on the browser, but this can be overridden.\nJavaScript\njstag.send({\n  _ul:\"en-us\",\n});\nAge (\nage\n)\nJavaScript\njstag.send({\n  age:25,\n});\nCompanies (\ncompanies\n)\nJavaScript\njstag.send({\n  companies:[\"Lytics\", \"Pantheon\"],\n});\nGender (\ngender\n)\nJavaScript\njstag.send({\n  gender: \"N/A\",\n})\nMeta\nCreated (\n_created\n)\nLytics automatically generate this and represents the oldest event associated with the user.\nModified (\n_modified\n)\nThis is automatically generated by Lytics and represents the last time the user was modified.\nLast Scored (\n_last_scored\n)\nThis is automatically generated by Lytics and represents the last time the users scores were updated.\nNumber of Aliases (\n_num_aliases\n)\nThis is automatically generated by Lytics and represents the number of aliases associated with the user.\nNumber of Days (\n_num_days\n)\nThis is automatically generated by Lytics and represents the number of days the user has existed.\nNumber of Events (\n_num_events\n)\nThis is automatically generated by Lytics and represents the number of events associated with the user.\nNumber of Streams (\n_num_streams\n)\nThis is automatically generated by Lytics and represents the number of streams associated with the user.\nStream Names (\n_streamnames\n)\nThis is automatically generated by Lytics and represents the names of the streams associated with the user.\nUser is Bot (\nis_bot\n)\nThis is automatically generated by Lytics and represents whether the user has been flagged as a bot or not.\nBehavior\nThe following attributes are all computed in real-time as the profile evolves. Each of the behavioral attributes are surfaced as a score between 0 and 100. These scores represent an aggregate summary of the user's behavior across various dimensions: Consistency, Frequency, Intensity, Maturity, Momentum, Propensity, Quantity, Recency, and Volatility.\nInterests\nLytics Content (\nlytics_content\n)\nThe interest attributes are computed in real-time and represent the user's interest in various topics. These topics are generated as a result of the analysis done by the Lytics Interest Engine and then associated with the user based upon their interaction with content on your site.\nIntelligence\nSegment Membership (\n_segments\n)\nThis attribute displays an array of all segments the user is currently a member of. It updates in real-time based on various audience definitions. Lytics offers a range of useful segments out of the box, requiring no additional setup. For detailed information on these audiences, refer to our Developer Tier > Audiences documentation.\nSplit & Split2 (\n_split\n&\n_split2\n)\nThese attributes are automatically generated by Lytics and represent a random value evenly distributed across users. They are useful for split testing and experimentation.\nNeeds Message (\nneeds_message\n)\nThis attribute is computed in real-time and represents the relative distance between now and the next predicted event. It is stream specific and is useful for understanding when a user is likely to engage again.\nNext Event (\nnext_event\n)\nThis attribute is computed in real-time and represents the next expected event. It is stream specific and is useful for understanding when a user is likely to engage again.\nLookalike Model Predictions & Lookalike Model Percentiles (\nsegment_prediction\n&\nsegment_prediction_percentile\n)\nThis attribute is computed in real-time and represents the scores resulting from Lytics Lookalike and SegmentML models. Out-of-the-box, Lytics offers a range of useful models, requiring no additional setup. For detailed information on these models, refer to our Developer Tier > Models documentation.\nActivity\nGeneral\nFirst Seen & Last Seen (\nevent_first_seen\n&\nevent_last_seen\n)\nBoth of these attributes are automatically populated based upon the\n_e\nvalue in the\njstag.send\npayload. By default Lytics will collect a\npv\nevent for each page view and this will automatically populate the\nfirst_seen\nand\nlast_seen\nattributes. Below is an example of collecting a custom event that would populate these attributes as well.\nJavaScript\njstag.send({\n  _e:\"custom_event\"\n});```\nChannels (\nchannels\n) [needs update]\nJavaScript\njstag.send({\n  _channel:\"web\",\n});\nDevices (\ndevices\n)\nJavaScript\njstag.send({\n  _device:\"desktop\",\n});\nHourly (\nhourly\n)\nThis attribute is automatically populated with a count of events per hour for the user.\nHour of Week (\nhourofweek\n)\nThis attribute is automatically populated with a count of events per hour of the week for the user.\nLast Active Timestamp (\nlast_active_ts\n)\nThis attribute is automatically populated with the last time an event was received in any stream for the user.\nLast Channel Activities (\nlast_channel_activities\n) [needs update]\nJavaScript\njstag.send({\n  _channel:\"web\",\n});\nWeb\nDomains (\ndomains\n)\nThis attribute is automatically populated with the domains the user has been active on.\nFirst Visit Timestamp (\nfirstvisit_ts\n)\nThis attribute is automatically populated with the first time the user visited the site and sends data to the\ndefault\nstream.\nLast Visit Timestamp (\nlastvisit_ts\n)\nThis attribute is automatically populated with the last time the user visited the site and sends data to the\ndefault\nstream.\nPageview Count (\npageviewct\n)\nThis attribute is automatically populated with the number of\n_pv\nevents recieved for the user.\nJavaScript\njstag.send({\n  _e:\"pv\"\n});\nReferring Domain (\nrefdomain\n)\nThis attribute is automatically populated with the referring domain for the user.\nJavaScript\njstag.send({\n  _ref:\"umami.lytics.com\",\n});\nUser Agent (\nuser_agent\n)\nThis attribute is automatically populated based on the user agent of the browser. This attribute must be turned on in your Lytics account to be collected.\nVisit Count (\nvisitct\n)\nThis attribute is automatically populated with the number of visits the user has had based on presence of the\n_sesstart\nkey in an event.\nJavaScript\njstag.send({\n  _sesstart:1\n});\nVisit City (\nvisit_city\n)\nThis attribute is automatically populated with the city the user visited from based upon GeoIP.\nVisit Country (\nvisit_country\n)\nThis attribute is automatically populated with the country the user visited from based upon GeoIP.\nVisit Region (\nvisit_region\n)\nThis attribute is automatically populated with the region the user visited from based upon GeoIP.\nForm Data (\nform_data\n)\nForm data is a wildcard attribute that allows you to pass a number of key value pairs that all get stored under the\nform_data\nattribute. This is useful for capturing form submissions.\nJavaScript\njstag.send({\n  formdata_fn:\"John\",\n  formdata_ln:\"Doe\",\n  formdata_someotherkey:\"somevalue\"\n});\nForms Submitted (\nforms_submitted\n)\nJavaScript\njstag.send({\n  form_name:\"newsletter\"\n});\nUTM Campaign Last (\nutm_campaign_last\n)\nJavaScript\njstag.send({\n  utm_campaign:\"holiday\"\n});\nUTM Campaigns (\nutm_campaigns\n)\nJavaScript\njstag.send({\n  utm_campaign:\"holiday\"\n});\nUTM Content Last (\nutm_content_last\n)\nJavaScript\njstag.send({\n  utm_content:\"recipe-1\"\n});\nUTM Contents (\nutm_contents\n)\nJavaScript\njstag.send({\n  utm_content:\"recipe-1\"\n});\nUTM Medium Last (\nutm_medium_last\n)\nJavaScript\njstag.send({\n  utm_medium:\"article\"\n});\nUTM Mediums (\nutm_mediums\n)\nJavaScript\njstag.send({\n  utm_medium:\"article\"\n});\nUTM Source Last (\nutm_source_last\n)\nJavaScript\njstag.send({\n  utm_source:\"google_ads\"\n});\nUTM Sources (\nutm_sources\n)\nJavaScript\njstag.send({\n  utm_source:\"google_ads\"\n});\nUTM Term Last (\nutm_term_last\n)\nJavaScript\njstag.send({\n  utm_term:\"example\"\n});\nUTM Terms (\nutm_terms\n)\nJavaScript\njstag.send({\n  utm_term:\"example\"\n});\nCampaign\nHover (\nly_hover\n) [needs update]\nJavaScript\njstag.send({\n  pf_widget_id: \"content-rec-modal\",\n  pf-widget-event: \"hover\"\n});\nImpressions (\nly_impressions\n) [needs update]\nJavaScript\njstag.send({\n  pf_widget_id: \"content-rec-modal\",\n  pf-widget-event: \"show\"\n});\nCloses (\nly_closes\n) [needs update]\nJavaScript\njstag.send({\n  pf_widget_id: \"content-rec-modal\",\n  pf-widget-event: \"close\"\n});\nConversions (\nly_conversions\n) [needs update]\nJavaScript\njstag.send({\n  pf_widget_id: \"content-rec-modal\",\n  pf-widget-event: \"conversion\"\n});\nMilestones (\nly_milestones\n) [needs update]\nJavaScript\njstag.send({\n  pf_widget_id: \"engaged-donation-page\",\n  pf-widget-event: \"milestone\"\n});\nGoals (\nly_goals\n) [needs update]\nJavaScript\njstag.send({\n  pf_widget_id: \"made-donation\",\n  pf-widget-event: \"goal\"\n});\nUpdated\n12 months ago\nWhatâ€™s Next\nDefault Segments",
  "source": "lytics"
}